nc: 10
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 3, C2f, [128, True]]        # 2
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 6, C2f, [256, True]]        # 4  ← P3 特征（跳连到 neck）
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 6, C2f, [512, True]]        # 6  ← P4 特征（跳连到 neck）
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 3, C2f, [1024, True]]       # 8  ← P5 特征
  # === 环境自适应模块：生成 P3/P4/P5 三组天气门控 ===
  - [-1, 1, EnvAdaptiveFusion, []]    # 9  （对 P5 做缩放，同时缓存 P3/P4 门控）

  - [-1, 1, SPPF, [1024, 5]]         # 10

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 11

  # ★ P4 跳连：用 WeatherGatedConcat 替代 Concat，根据天气调节 backbone P4 的贡献
  - [[-1, 6], 1, WeatherGatedConcat, [1, "p4"]]       # 12

  - [-1, 3, C2f, [512]]                               # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 14

  # ★ P3 跳连：用 WeatherGatedConcat 替代 Concat，根据天气调节 backbone P3 的贡献
  - [[-1, 4], 1, WeatherGatedConcat, [1, "p3"]]       # 15

  - [-1, 3, C2f, [256]]                               # 16

  - [-1, 1, Conv, [256, 3, 2]]                        # 17
  - [[-1, 13], 1, Concat, [1]]                        # 18  ← head 内部拼接
  - [-1, 3, C2f, [512]]                               # 19

  - [-1, 1, Conv, [512, 3, 2]]                        # 20
  - [[-1, 10], 1, Concat, [1]]                        # 21  ← head 内部拼接
  - [-1, 3, C2f, [1024]]                              # 22

  - [[16, 19, 22], 1, Detect, [nc]]                   # 23